In [2]:
import pandas as pd

In [4]:
mydict = [{'a': 1, 'b': 2, 'c': 3, 'd': 4},
          {'a': 100, 'b': 200, 'c': 300, 'd': 400},
          {'a': 1000, 'b': 2000, 'c': 3000, 'd': 4000}]
df = pd.DataFrame(mydict)
df

      a     b     c     d
0     1     2     3     4
1   100   200   300   400
2  1000  2000  3000  4000

In [5]:
df.iloc[[0]]

   a  b  c  d
0  1  2  3  4

In [7]:
df.iloc[[0,1]]

     a    b    c    d
0    1    2    3    4
1  100  200  300  400

In [9]:
df.iloc[:3]

#This returns the values up to 3 values

      a     b     c     d
0     1     2     3     4
1   100   200   300   400
2  1000  2000  3000  4000

In [10]:
df.iloc[[True,False,True]]

#The "TRUE" index will retrun in output and false will not return in output

      a     b     c     d
0     1     2     3     4
2  1000  2000  3000  4000

In [11]:
df.iloc[lambda x: x.index % 2 ==0]

#This will checks whether the index of each row is even and retruns the evn rows

      a     b     c     d
0     1     2     3     4
2  1000  2000  3000  4000

In [14]:
df.iloc[lambda x: x.index % 2 !=0]

#From above exmaple this will return the odd rows

     a    b    c    d
1  100  200  300  400

In [16]:
df.iloc[2,3]

#scalar integers which will return the value at that postion
#in this case this is 2nd row and 3rd column

4000

In [18]:
df.iloc[[1,2],[2,3]]

#This is with list of integers at that particular points respectively

      c     d
1   300   400
2  3000  4000

In [19]:
df

      a     b     c     d
0     1     2     3     4
1   100   200   300   400
2  1000  2000  3000  4000

In [28]:
df.iloc[1:3,2:3]

#This will give the ouput which are at 1,3 and 0,3 postions

      c
1   300
2  3000

In [36]:
df

      a     b     c     d
0     1     2     3     4
1   100   200   300   400
2  1000  2000  3000  4000

In [40]:
df.iloc[:,[True, False, True,False]]

#True value means the corresponding row will be included in the result, and each False value means the corresponding row will be excluded.

      a     c
0     1     3
1   100   300
2  1000  3000

In [35]:
df

      a     b     c     d
0     1     2     3     4
1   100   200   300   400
2  1000  2000  3000  4000

In [30]:
df.iloc[:, lambda df: [0, 2]]

#This is useful for selecting specific columns dynamically based on their positions in the DataFrame.

      a     c
0     1     3
1   100   300
2  1000  3000